In [34]:
import pandas as pd

In [35]:
df = pd.read_csv("titanic.csv")

In [36]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [37]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [38]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [39]:
inputs = df.drop(['Survived'],axis='columns')
target = df.Survived

In [40]:
dummies_sex = pd.get_dummies(inputs.Sex)
dummies_sex.head(5)

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [41]:
inputs1 = pd.concat([inputs,dummies_sex],axis='columns')
inputs1.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [42]:
inputs = inputs1.drop(['female','male'],axis = 'columns')

In [43]:
inputs1 = pd.concat([inputs,dummies_sex],axis='columns')

In [44]:
inputs1.head(5)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [45]:
inputs1.drop(['Sex','male'],axis='columns',inplace=True)
inputs1.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [46]:
inputs1.columns[inputs1.isna().any()]

Index(['Age'], dtype='object')

In [47]:
inputs1.Pclass = inputs.Pclass.fillna(inputs1.Pclass.mean())
inputs1.Age = inputs.Age.fillna(inputs1.Age.mean())
inputs1.Fare = inputs.Fare.fillna(inputs1.Fare.mean())

In [48]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [49]:
inputs1.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [87]:
from sklearn.model_selection import train_test_split
X_train,X_test, y_train, y_test = train_test_split(inputs1,target,test_size=0.2)

In [76]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [77]:
model.fit(X_train,y_train)

GaussianNB()

model.score(X_test,y_test)

In [88]:
model.score(X_test,y_test)

0.8156424581005587

In [89]:
X_test[0:10]

     Pclass        Age      Fare  female
716       1  38.000000  227.5250       1
846       3  29.699118   69.5500       0
448       3   5.000000   19.2583       1
408       3  21.000000    7.7750       0
790       3  29.699118    7.7500       0
418       2  30.000000   13.0000       0
760       3  29.699118   14.5000       0
795       2  39.000000   13.0000       0
5         3  29.699118    8.4583       0
31        1  29.699118  146.5208       1

In [90]:
y_test[0:10]

716    1
846    0
448    1
408    0
790    0
418    0
760    0
795    0
5      0
31     1
Name: Survived, dtype: int64

In [91]:
model.predict(X_test[0:10])

array([1, 0, 1, 0, 0, 0, 0, 0, 0, 1], dtype=int64)

In [93]:
model.predict_proba(X_test[0:10])

array([[8.47929259e-10, 9.99999999e-01],
       [8.90412669e-01, 1.09587331e-01],
       [2.81712324e-01, 7.18287676e-01],
       [9.61044576e-01, 3.89554235e-02],
       [9.66102317e-01, 3.38976826e-02],
       [9.27658589e-01, 7.23414109e-02],
       [9.66497227e-01, 3.35027729e-02],
       [9.32254374e-01, 6.77456257e-02],
       [9.66200124e-01, 3.37998758e-02],
       [6.36483863e-05, 9.99936352e-01]])

In [94]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.78321678, 0.74825175, 0.79577465, 0.78873239, 0.76056338])